[
  {"doc_id":"F2020-AR-C017","type":"Annual Report","date":"2021-03-01","title":"2020 Annual Report","body":"Aurora NeuroTech revealed its first AuroraLink non-invasive BCI prototype, reaching $7.2 million revenue in 2020 with clinical pilot traction. Key risks include regulatory approvals and hardware scaling. ESG efforts emphasize sustainable manufacturing and patient privacy."},
  {"doc_id":"F2021-AR-C017","type":"Annual Report","date":"2022-02-28","title":"2021 Annual Report","body":"Revenue rose to $10.8m as NeuroFlow analytics beta was released in hospitals. Growing investment in R&D, clinical collaborations, and increasing IP portfolio defined the year."},
  {"doc_id":"F2022-AR-C017","type":"Annual Report","date":"2023-02-27","title":"2022 Annual Report","body":"Breakthrough Device status granted by FDA opened pathways for rapid adoption. Revenue rose to $14.6m. Continued progress on adaptive decoding IP filed in 2022 patents."},
  {"doc_id":"F2023-AR-C017","type":"Annual Report","date":"2024-02-29","title":"2023 Annual Report","body":"Established landmark partnership with VA Hospitals for prosthetic rehabilitation pilots, validating tech in social healthcare. Revenue grew to $18m. Social impact recognition increased."},
  {"doc_id":"F2024-AR-C017","type":"Annual Report","date":"2025-02-28","title":"2024 Annual Report","body":"Launched ethical AI transparency portal amid rising scrutiny. Expanded hospital deployments drove revenue to $21.2m. Diversity in clinical trials achieved new record."},
  {"doc_id":"ER-2025-08-C017","type":"Earnings Release","date":"2025-08-19","title":"Q2 2025 Earnings","body":"Aurora NeuroTech reported revenue of $22.8m, EPS up 22%, ARR adoption growing as hospitals expand contracts. Investor confidence strengthened."},
  {"doc_id":"JV-2025-02-C017","type":"Joint Venture Announcement","date":"2025-02-10","title":"Aurora Neuro-Cloud Joint Venture","body":"Aurora NeuroTech formed JV with Medisafe Health and Borealis CloudWorks to combine neurotechnology with secure cloud AI for healthcare. Benefits include federated learning and cross-domain adoption."},
  {"doc_id":"FDA-2022-11-C017","type":"FDA Designation","date":"2022-11-15","title":"FDA Breakthrough Device Designation","body":"FDA granted Breakthrough Device designation for AuroraLink BCI system based on potential to address significant unmet medical need in neurological rehabilitation and assistive technology applications."},
  {"doc_id":"PART-2023-09-C017","type":"Partnership Agreement","date":"2023-09-08","title":"VA Hospitals Rehabilitation Partnership","body":"Strategic partnership with Veterans Affairs hospitals for neuroprosthetic rehabilitation pilot programs. Partnership includes clinical validation studies and technology integration across VA medical centers."},
  {"doc_id":"POL-2024-04-C017","type":"Policy Document","date":"2024-04-05","title":"Ethical AI and Clinical Transparency Policy","body":"Comprehensive ethical framework for neurotechnology development including patient consent protocols, data privacy protection, and algorithmic transparency standards for clinical applications."},
  {"doc_id":"CLINICAL-2021-03-C017","type":"Clinical Study","date":"2021-03-25","title":"First Clinical Study Initiation","body":"Initiated first clinical study evaluating safety and preliminary efficacy of AuroraLink BCI system in patients with motor disabilities. Study includes safety monitoring and functional outcome assessments."},
  {"doc_id":"FUND-2022-02-C017","type":"Funding Document","date":"2022-02-14","title":"Series B Funding Round $35 Million","body":"Series B funding completed raising $35 million from neurotechnology and healthcare focused investors. Funding supports clinical development, regulatory approval processes, and commercial scaling preparation."},
  {"doc_id":"INTEL-2022-06-C017","type":"Technology Partnership","date":"2022-06-20","title":"Intel Neuromorphic Computing Collaboration","body":"Partnership with Intel for neuromorphic computing technology integration enhancing AuroraLink processing capabilities and power efficiency. Collaboration includes joint development of specialized neural processing algorithms."},
  {"doc_id":"SUCCESS-2022-12-C017","type":"Customer Success Story","date":"2022-12-05","title":"NeuroClinix Clinical Deployment","body":"Successful deployment of AuroraLink system at NeuroClinix specialized neurology clinic demonstrating improved patient outcomes and clinician workflow integration. Case study shows measurable improvements in rehabilitation effectiveness."},
  {"doc_id":"MINDBRIDGE-2023-11-C017","type":"Product Launch","date":"2023-11-30","title":"MindBridge Rehabilitation Tools Launch","body":"Launch of MindBridge specialized rehabilitation tools for neurological recovery applications. Platform includes adaptive training protocols and progress monitoring capabilities for clinical rehabilitation settings."},
  {"doc_id":"EMA-2024-01-C017","type":"Regulatory Approval","date":"2024-01-20","title":"European CE Marking Achievement","body":"Received CE marking for AuroraLink BCI system enabling commercial distribution across European markets. Approval covers medical device safety and performance requirements for neurological rehabilitation applications."},
  {"doc_id":"CONFERENCE-2024-10-C017","type":"Conference Presentation","date":"2024-10-28","title":"NeuroTech Innovation Conference Keynote","body":"Keynote presentation at International NeuroTechnology Conference demonstrating breakthrough BCI capabilities and clinical applications. Presentation highlighted Aurora's technology leadership in non-invasive neural interfaces."},
  {"doc_id":"PHASE2-2025-04-C017","type":"Clinical Results","date":"2025-04-22","title":"Phase II Clinical Study Results","body":"Published positive results from Phase II clinical study showing significant improvement in motor function recovery and quality of life measures. Results support regulatory filing for expanded clinical indications."},
  {"doc_id":"BREAKTHROUGH-2025-08-C017","type":"Technology Breakthrough","date":"2025-08-15","title":"Wireless Neural Interface Development","body":"Breakthrough development in wireless neural interface technology enabling untethered operation and improved patient mobility. Technology represents significant advancement in BCI usability and clinical adoption potential."},
  {"doc_id":"MILESTONE-2025-08-C017","type":"Financial Milestone","date":"2025-08-12","title":"Revenue Milestone Achievement","body":"Achieved $100 million annual revenue run-rate milestone reflecting strong clinical adoption and market expansion. Milestone validates commercial viability and growth trajectory in neurotechnology market."}
]
