[
  {"doc_id":"F2020-AR-C008","type":"Annual Report","date":"2021-03-01","title":"2020 Annual Report","body":"NeuraGen AI reported $35.9 million revenue in 2020 with 60% gross margin. Pilot tests with NHS Trusts show promising diagnostic accuracy. Investments in explainability patents and model fairness underway. Risk includes regulatory delays and privacy concerns. Management focuses on responsible AI and transparent models. The report details clinical partnerships, expanding pipeline, R&D milestones, liquidity of $6.2 million and ESG goals aligned with privacy and patient safety."},
  {"doc_id":"F2021-AR-C008","type":"Annual Report","date":"2022-02-28","title":"2021 Annual Report","body":"Revenue grew to $61.6 million with improved AI forecasting capabilities. PredictCare oncology beta launched to strong early feedback. A $60M Series C round enables expanded R&D and scale-up with focus on safe AI governance and regulatory compliance. Clinical validations and patent filings increase moat. Governance policies addressing bias and fairness strengthened."},
  {"doc_id":"F2022-AR-C008","type":"Annual Report","date":"2023-02-27","title":"2022 Annual Report","body":"Revenue of $79.8 million reflects increased NHS wins and international growth. FDA breakthrough designation achieved accelerating US market entry. Partnerships with Medisafe Health and cloud providers enhance service offerings. Attention raised on competitive challenges and need to maintain transparency around data. Higher R&D spend on genomic model integration and auditability."},
  {"doc_id":"F2023-AR-C008","type":"Annual Report","date":"2024-02-29","title":"2023 Annual Report","body":"Growth to $96.1 million revenue despite temporary reputation setback from data bias claims in Q1 2024. Audit and remediation actions have been completed with external validation. Regulatory landscape evolving steadily with MHRA guidance expected to clarify device approvals. Partnership expansions with NHS Trusts and Medisafe strengthen market leadership."},
  {"doc_id":"F2024-AR-C008","type":"Annual Report","date":"2025-02-28","title":"2024 Annual Report","body":"Revenue increased to $112.7 million driven by expanded clinical deployments and predictive AI expansion. Independent validation led to improved win rates post-controversy. ESG commitments to AI ethics and sustainability progress. Collaboration JV with cloud and healthcare data partners formalized. Outlook positive with regulatory clarity anticipated."},
  {"doc_id":"IP2021-09-C008","type":"Investor Presentation","date":"2021-09-02","title":"PredictCare Oncology Beta","body":"Presentation on AI forecasting models targeting oncology outcomes. Includes clinical trial data snippets, model explainability features, and projected market opportunity exceeding $1.5B. Partnerships with leading cancer centers disclosed."},
  {"doc_id":"IP2023-05-C008","type":"Investor Presentation","date":"2023-05-10","title":"Series C Funding and Scale Strategy","body":"Slides illustrate capital allocation plans to accelerate AI R&D, international expansion, regulatory engagements, and customer acquisition."},
  {"doc_id":"USPTO-2020-09-C008","type":"Patent Filing","date":"2020-09-18","title":"Model Explainability Architecture","body":"Filed patents outlining mechanisms for transparent AI decision paths, model confidence scoring and regulatory-ready audit trails."},
  {"doc_id":"CASE-2023-11-C008","type":"Case Study","date":"2023-11-14","title":"NHS Trust Multi-Site Deployment","body":"Highlights deployment at 5 sites with documented improvement in diagnostic speed, staff training efficiency and patient outcomes."},
  {"doc_id":"REPORT-2024-08-C008","type":"Audit Report","date":"2024-08-19","title":"Data Bias Integrity Audit","body":"Third-party audit confirms AI datasets passed fairness criteria. Recommendations include ongoing monitoring and transparency disclosures."},
  {"doc_id":"PR-2024-03-C008","type":"Press Release","date":"2024-03-27","title":"Internal Audit Initiated on Alleged Data Bias","body":"Company responds to industry rumors with immediate audit and commitment to transparency and corrective measures."},
  {"doc_id":"JV-2025-02-C008","type":"Joint Venture Release","date":"2025-02-10","title":"NeuraGen AI Forms Clinical JV with Medisafe Health and Borealis CloudWorks","body":"Announces strategic partnership combining predictive AI, clinical data, and cloud scale for enhanced healthcare analytics and decision support."},
  {"doc_id":"ER-2025-08-C008","type":"Earnings Release","date":"2025-08-19","title":"Q2 2025 Earnings Beat & Raise","body":"EPS growth of 22% year-over-year accompanied by strong ARR expansion to $140 million. Positive market reception to JV accelerates pipeline growth and cross-sector innovation."},
  {"doc_id":"FDA-2022-BKD-C008","type":"FDA Document","date":"2022-06-16","title":"Breakthrough Device Designation Letter","body":"FDA grants Breakthrough Device Designation for NeuraDiagnose platform based on potential to provide more effective treatment for life-threatening conditions. Designation provides expedited review pathway and enhanced FDA communication."},
  {"doc_id":"PART-2020-11-C008","type":"Partnership Agreement","date":"2020-11-25","title":"Mayo Clinic Research Collaboration","body":"Strategic research partnership with Mayo Clinic for clinical validation of AI diagnostic algorithms in oncology applications. Collaboration includes data sharing agreements and joint research publications."},
  {"doc_id":"USPTO-2021-02-C008","type":"Patent Grant","date":"2021-02-18","title":"Diagnostic Algorithm Patent Grant","body":"Patent granted for core AI diagnostic methodology including feature extraction, pattern recognition, and clinical decision support algorithms. Patent provides competitive protection for fundamental diagnostic AI technology."},
  {"doc_id":"PART-2023-03-C008","type":"Partnership Agreement","date":"2023-03-14","title":"Medisafe Health Strategic Partnership","body":"Comprehensive partnership integrating NeuraGen AI analytics platform with Medisafe Health clinical workflows. Partnership includes technology integration, joint go-to-market strategy, and shared clinical evidence development."},
  {"doc_id":"MHRA-2025-07-C008","type":"Regulatory Guidance","date":"2025-07-15","title":"MHRA AI Medical Device Guidance","body":"UK Medicines and Healthcare products Regulatory Agency publishes comprehensive guidance for AI-based medical devices including software as medical device requirements, clinical evidence standards, and post-market surveillance obligations."},
  {"doc_id":"STUDY-2025-07-C008","type":"Clinical Study","date":"2025-07-25","title":"AI Diagnostic Accuracy Validation Study","body":"Peer-reviewed study published in Journal of Medical AI demonstrating 25% improvement in diagnostic accuracy using NeuraGen AI platform across multiple clinical sites. Study includes 10,000 patient cases with independent clinical validation."},
  {"doc_id":"CONT-2025-06-C008","type":"Contract Document","date":"2025-06-18","title":"European Health Network Deployment Contract","body":"Multi-year contract for AI diagnostic platform deployment across European hospital network including 50 hospitals in 8 countries. Contract value $6.5 million annually with expansion options based on clinical outcomes and utilization metrics."}
]
