[{"doc_id":"F2020-AR-C006","type":"Annual Report","date":"2021-03-01","title":"2020 Annual Report","body":"Luminara AR Tech closed FY2020 with revenue of $35.8 million, gross margin of 56.7%, and an operating loss attributable to scale-up investments in hardware reliability and collaboration software. The company progressed from pilots to early production deployments in industrial settings, enabled by its HaloSight platform and LumaCollab suite. Risks disclosed include sensor supply constraints, safety liabilities in field use, and competitive pressure from larger XR vendors. Management emphasized ISO-driven safety processes, repairable hardware designs, and privacy-friendly on-device processing. Liquidity remained adequate with $4.1 million in cash and access to committed facilities. The company committed to publishing quantified case studies and to expanding its partner training program to ensure consistent field outcomes."},
{"doc_id":"F2021-AR-C006","type":"Annual Report","date":"2022-02-28","title":"2021 Annual Report","body":"FY2021 revenue rose to $48.1 million with improving margins as HaloSight Pro v2 launched. Integration with green-edge nodes reduced latency for EU buyers and supported ESG-driven procurement. Luminara filed patents on foveated rendering and tracking, and expanded localization to 10 languages. Operating expenses grew with R&D and partner enablement. Management outlined a roadmap to deeper CAD/PLM integration and more rigorous safety telemetry governance, anticipating demand in aviation MRO and automotive manufacturing."},
{"doc_id":"F2022-AR-C006","type":"Annual Report","date":"2023-02-27","title":"2022 Annual Report","body":"Revenue reached $72.2 million, reflecting broader adoption of LumaCollab 3.0 with CAD/PLM plug-ins. The company navigated depth sensor shortages through allocation programs and renegotiated supplier agreements with banded pricing. A patent grant on hand/eye co-tracking established differentiation for low-drift interaction. Management increased VAR coverage in DACH and Nordics and invested in reliability improvements. Risks include smear tactics by competitors and tightening safety expectations, which Luminara addresses with transparent telemetry and certifications."},
{"doc_id":"F2023-AR-C006","type":"Annual Report","date":"2024-02-28","title":"2023 Annual Report","body":"Revenue rose to $90.6 million with margin expansion. An astroturfed review scandal surfaced in Q1, traced to a contracted marketing vendor. Luminara terminated the relationship, implemented third-party moderation, and disclosed policy changes. Zero-trust telemetry integration with a security partner enabled sales to regulated buyers. Customer stories in healthcare training highlighted incident reductions. Management reiterated a commitment to integrity, validated claims, and measurable outcomes."},
{"doc_id":"F2024-AR-C006","type":"Annual Report","date":"2025-02-28","title":"2024 Annual Report","body":"FY2024 revenue reached $103.6 million with continued gross margin expansion, supported by LumaLink robot-control add-on launches. A widely viewed controversy alleging a staged occlusion demo prompted Luminara to release raw capture logs and commission a blind test protocol from an independent lab, which later validated the core pipeline and safety overlays. The company published EU worker-safety mapping and broadened APAC VAR coverage. Risks include sector price pressure from hyperscalers and hardware batch variance. Management reported proactive QC, proof-driven marketing, and partner ecosystem growth."},
{"doc_id":"IP-2021-07-C006","type":"Investor Presentation","date":"2021-07-29","title":"HaloSight Pro v2 Launch","body":"The 12-slide deck summarizes depth fusion improvements, drift correction via co-tracking, and repairable frame designs. Benchmarks demonstrate reduced occlusion error and improved comfort. Pricing moves ASPs by 8% while protecting TCO."},
{"doc_id":"IP-2022-09-C006","type":"Investor Presentation","date":"2022-09-06","title":"LumaCollab 3.0 with CAD/PLM","body":"Details plug-in architecture for major CAD/PLM systems, session persistence, and annotation sync. Case studies show design iteration time reduction and better cross-site alignment."},
{"doc_id":"IP-2023-08-C006","type":"Investor Presentation","date":"2023-08-22","title":"Zero-Trust Telemetry (with C004)","body":"Explains policy attestation for telemetry, how on-device indices minimize data outflow, and why regulated buyers prefer attestations tied to incidents."},
{"doc_id":"IP-2024-11-C006","type":"Investor Presentation","date":"2024-11-14","title":"LumaLink Robot-Control","body":"Introduces hands-free robot tasks for line changeovers. Latency measurements, safety interlocks, and adapter roadmap for three leading robot vendors are included."},
{"doc_id":"LAB-2024-05","type":"Independent Lab Report","date":"2024-05-13","title":"Validation of Foveated Rendering and Safety Overlays","body":"An independent lab conducted blind tests of Luminara's rendering and overlay systems. The report documents measured energy draw improvements with gaze-adaptive sampling, consistent occlusion handling under varied lighting, and accurate safety boundary overlays in cluttered scenes. Limitations include occasional marker loss in reflective environments. Conclusion: the system meets published claims."},
{"doc_id":"PR-2024-02","type":"Press Release","date":"2024-02-19","title":"Release of Raw Demo Logs","body":"To address concerns regarding demo authenticity, Luminara released timestamped logs, sensor captures, and pipeline settings for independent review, and engaged a third-party lab to define a blind protocol prior to testing."},
{"doc_id":"POL-2023-04","type":"Policy","date":"2023-04-05","title":"Review Integrity & Moderation","body":"The policy bans paid or undisclosed endorsements, mandates third-party moderation for public reviews, and establishes internal escalation paths and audit trails for content integrity."},
{"doc_id":"CASE-2020-06-TF","type":"Case Study","date":"2020-11-09","title":"TechForge: Rework -22% with AR SOP Overlays","body":"Quantified savings include rework reduction and safety incident avoidance in assembly lines, with process checkpoints verified via AR prompts."},
{"doc_id":"CASE-2021-12-SB","type":"Case Study","date":"2022-01-15","title":"SkyBridge: AR MRO Checklists","body":"Airline MRO teams use AR overlays for inspection sequences, reducing missed steps and increasing audit readiness."},
{"doc_id":"CASE-2023-10-MH","type":"Case Study","date":"2023-10-03","title":"Medisafe: AR Training Labs","body":"Clinical training scenarios conducted in AR led to faster skill acquisition and fewer lab incidents, with data logged for audits."},
{"doc_id":"ALLY-2021-10","type":"Technical Note","date":"2021-10-05","title":"Pre-caching on Green Nodes","body":"Describes asset pre-fetch strategies over Borealis nodes for low-latency sessions while tracking carbon-aware workloads."},
{"doc_id":"PRIV-2021-09","type":"Technical Note","date":"2021-09-22","title":"On-Device Vector Index","body":"Outlines privacy-preserving retrieval for AR by indexing locally and minimizing telemetry export."},
{"doc_id":"REG-2024-12","type":"Guidance Mapping","date":"2024-12-02","title":"EU Worker Safety Guidance Mapping","body":"Maps AR overlays and safety boundaries to EU guidance for field operations, helping procurement teams assess compliance quickly."},
{"doc_id":"ECO-2025-02","type":"Ecosystem Brief","date":"2025-02-28","title":"Robot Vendor Adapters","body":"Summarizes adapter interfaces and safety interlocks with three robot platforms, including emergency stop propagation and audit trails."},
{"doc_id":"ER-2025-08","type":"Earnings Release","date":"2025-08-19","title":"Q2 2025 Beat & Raise","body":"Highlights EPS +29% YoY, stable gross margins despite sector pricing pressure, and strong pipeline conversion following independent validation and regulated-stack integrations."}
]