[{"doc_id":"F2020-10K-C004","type":"10-K Filing","date":"2021-03-01","title":"Annual Report for Fiscal Year 2020","body":"Cobalt CyberGuard Inc. reports consolidated revenue of $96.0 million, representing 24% year-over-year growth as customers accelerated zero-trust adoption amid pandemic-driven remote work. Gross margin held steady at 66.7% due to a software-heavy product mix, with operating cash flow at $14.9 million. Key developments included the general availability release of SentinelMesh XDR in March 2020, expansion of the managed SOC from Boston to Denver, and 15 new patents filed across adaptive deception and micro-segmentation technologies. Risk Factors: exposure to supply-chain attacks on Taiwanese TPM vendors, evolving privacy regulations like GDPR, and talent constraints in a competitive cybersecurity labor market. Liquidity and Capital Resources: ended the year with $8.8 million in cash and cash equivalents, plus an undrawn $12 million revolving credit facility. ESG Highlights: the Company sourced 42% of datacenter power from renewables and initiated a diversity hiring program. Management certifies that there are no material weaknesses in internal controls over financial reporting under Section 404. The report includes full audited financial statements, management's discussion and analysis of financial condition and results of operations, quantitative and qualitative disclosures about market risk, and changes in and disagreements with accountants on accounting and financial disclosure. Signed by Dr. Iris Nguyen (CEO), Jamal Carter (COO/President), and Grant & Mason LLP (Independent Registered Public Accounting Firm). This filing is made pursuant to Section 13(a) of the Securities Exchange Act of 1934."},
{"doc_id":"F2021-10K-C004","type":"10-K Filing","date":"2022-02-28","title":"Annual Report for Fiscal Year 2021","body":"Revenue increased to $128.4 million, a 34% rise from 2020, driven by strong demand for ForgeShield gateway in enterprise segments. Gross margin improved to 67.0%, with net income of $11.4 million. The Series B financing of $75 million was completed in July 2021, boosting cash to $27.1 million at year-end. Investments included $23.6 million in R&D for post-quantum key rotation and $6 million in capex for EU SOC. No material weaknesses in ICFR were identified. Board diversity reached 43% female/non-binary members. Full IFRS reconciliation is attached for international stakeholders. Risk factors updated to include potential litigation from false-positive detections. The report contains detailed notes on revenue recognition (primarily subscription-based), stock-based compensation, and lease commitments. Management's discussion highlights the acquisition of a small networking startup in Q1 2022 as a key growth driver. Signed by the executive team and auditors."},
{"doc_id":"F2022-10K-C004","type":"10-K Filing","date":"2023-02-27","title":"Annual Report for Fiscal Year 2022","body":"Revenue reached $156.3 million, up 22% YoY. Major milestones: FedRAMP Moderate authorization in Q3, acquisition of NetSec Switch for $6 million, and 12 patent grants. Operating income was $29.6 million, with cash at $31.5 million. New ESG KPIs tie 15% of executive bonuses to emissions reduction targets. The report includes a comprehensive risk section on geopolitical tensions affecting supply chains and emerging AI threats. Financial statements show ARR growth to $140 million. No changes in accounting principles. Signed with auditor opinion."},
{"doc_id":"F2023-10K-C004","type":"10-K Filing","date":"2024-02-29","title":"Annual Report for Fiscal Year 2023","body":"Revenue $162.9 million, flat YoY due to Q3 scandal impact. The FTC settlement for fake threat-intel reports was $650k, expensed in Q4. DeepBlue Forensics was integrated, with synergies projected at $4.2 million. Ethical marketing council was established to prevent recurrence. Net income $15.1 million. Cash $35.2 million. Report includes updated diversity metrics and a new section on post-quantum readiness. Auditor notes no going-concern issues."},
{"doc_id":"F2024-10K-C004","type":"10-K Filing","date":"2025-02-28","title":"Annual Report for Fiscal Year 2024","body":"Revenue $195.1 million, +20% YoY, with net income $18.5 million. The supply-chain breach in Q2 cost $1.2 million in incident response but no customer SLAs were breached. ForgeShield v3 launched in Q4. JV term sheet with C002 and C003 was signed in December 2024 for 'Tri-Forge' zero-trust cloud. Cash $40.8 million. ESG progress: 68% remote work reduced carbon footprint by 15%. Full financials, including segment reporting for MDR vs software, are provided."},
{"doc_id":"IP2021-07-C004","type":"Investor Presentation","date":"2021-07-05","title":"Series B Growth Strategy","body":"Slide 1: Overview - $75M oversubscribed round led by Shield Capital. Slide 2: Use of Proceeds - 40% R&D for post-quantum, 35% SOC expansion, 15% GTM, 10% contingency. Slide 3: Market TAM - $185B cybersecurity, CAGR 12%, Cobalt positioned for 8% share in zero-trust. Slide 4: Competitive Matrix - Vs CrowdStrike (endpoint) and Palo Alto (network), Cobalt excels in autonomous response. Slide 5: 2022 Milestones - FedRAMP, EU SOC, 20 patents. Slide 6: ESG Roadmap - Net-zero by 2032, diversity goals. Slide 7: Financial Forecasts - Revenue $170M, GM 68%, EBITDA $35M. Slide 8: Team - Dr. Nguyen (CEO), Carter (President), 740 employees. Slide 9: Risks & Mitigations - Supply-chain (diversified vendors), regs (compliance team). Slide 10: Q&A - Contact ir@cobalt-cg.com."},
{"doc_id":"IP2023-05-C004","type":"Investor Presentation","date":"2023-05-09","title":"Ransomware-Response Roll-Out","body":"Slide 1: Product Intro - Automated decrypt and key-search module for SentinelMesh. Slide 2: Features - AI-driven chain analysis, integration with ForgeShield. Slide 3: Case Studies - Hospital recovered in 4 hours; school district avoided $500k ransom. Slide 4: Pricing - $5k/endpoint annual add-on. Slide 5: Market - $20B ransomware threat. Slide 6: Projections - Add $12M ARR in 18 months. Slide 7: Q&A."},
{"doc_id":"IP2024-02-C004","type":"Investor Presentation","date":"2024-02-05","title":"Secure Browser Plugin Collaboration with Mozilla","body":"Slide 1: Partnership Overview - Joint dev with Mozilla for phishing defense in Firefox. Slide 2: Tech Details - Micro-segmentation for browser sessions. Slide 3: Benefits - Reduces credential theft by 60%. Slide 4: Timeline - Beta Q2 2024, GA Q4. Slide 5: Market Impact - 100K installs projected first month. Slide 6: Financials - $2M revenue from premium version. Slide 7: Q&A."},
{"doc_id":"IP2025-02-C004","type":"Investor Presentation","date":"2025-02-11","title":"‘Tri-Forge’ JV Deck","body":"Slide 1: JV Overview - With C002 (vision AI) and C003 (cloud) to build zero-trust cloud stack. Slide 2: Goal - Dethrone Sentinel Fortress in hyperscale security. Slide 3: Tech Synergies - Vision for anomaly, cloud for scale, Cobalt for defense. Slide 4: Shared Patent Pool - 10 filings in year 1. Slide 5: GTM Phases - Beta Q3 2025, GA 2026. Slide 6: TAM Displacement - $6B addressable. Slide 7: Q&A."},
{"doc_id":"HIST2020-C004","type":"Company History","date":"2020-03-18","title":"SentinelMesh XDR Launch","body":"Amid COVID, Cobalt launched its flagship XDR platform, converting 12 pilots to paying customers and boosting Q2 revenue by 8%. This marked the shift from lab spin-out to enterprise vendor."},
{"doc_id":"HIST2021A-C004","type":"Company History","date":"2021-02-15","title":"Leadership Promotion","body":"Jamal Carter promoted to President, overseeing global expansion and R&D for post-quantum tech."},
{"doc_id":"HIST2021B-C004","type":"Company History","date":"2021-07-05","title":"Series B Funding","body":"Closed $75M Series B, enabling EU SOC opening and 12 patent filings."},
{"doc_id":"HIST2022-C004","type":"Company History","date":"2022-02-10","title":"NetSec Switch Acquisition","body":"Acquired NetSec Switch for $6M, adding SDN to XDR for better network visibility."},
{"doc_id":"HIST2023A-C004","type":"Company History","date":"2023-05-08","title":"Ransomware Module Launch","body":"Released ransomware-response add-on, improving NPS by 8 points."},
{"doc_id":"HIST2023B-C004","type":"Company History","date":"2023-08-14","title":"Fake Threat-Intel Scandal","body":"Marketing team fabricated rival breach stats to gain edge over CrowdStrike; FTC fine $650k, leading to 7% revenue dip and ethics council formation."},
{"doc_id":"HIST2023C-C004","type":"Company History","date":"2023-10-16","title":"DeepBlue Forensics Acquisition","body":"Bought DeepBlue for $9M, enhancing DFIR capabilities post-scandal."},
{"doc_id":"HIST2024A-C004","type":"Company History","date":"2024-02-05","title":"Mozilla Collaboration","body":"Partnered with Mozilla for secure browser plugin, projecting 100k installs."},
{"doc_id":"HIST2024B-C004","type":"Company History","date":"2024-05-14","title":"Supply-Chain Breach","body":"Signed-update channel poisoned via supplier; patched in 48 hours, no data loss."},
{"doc_id":"HIST2024C-C004","type":"Company History","date":"2024-11-22","title":"ForgeShield v3 Launch","body":"v3 with hardware-anchored micro-seg, driving 20% upsell."},
{"doc_id":"HIST2025-C004","type":"Company History","date":"2025-02-10","title":"Tri-Forge JV","body":"JV with C002 and C003 to build zero-trust cloud, targeting Sentinel Fortress takedown."}
]