[
  {"doc_id":"F2020-AR-C016","type":"Annual Report","date":"2021-03-01","title":"2020 Annual Report","body":"NanoMed Therapeutics reported revenue of $15.5 million in 2020 with successful IND filing enabling clinical development initiation. Patent portfolio expanded with nanoparticle targeting technology protection. Key challenges include clinical trial execution and manufacturing scale-up. ESG initiatives emphasize sustainable nanomaterial production and equitable clinical trial access."},
  {"doc_id":"F2021-AR-C016","type":"Annual Report","date":"2022-02-28","title":"2021 Annual Report","body":"Revenue grew to $25.4 million with Phase I trial initiation and European operations establishment. Series A funding of $40 million enables accelerated clinical development and manufacturing preparation. Technology partnerships with materials suppliers enhance nanoparticle formulation capabilities."},
  {"doc_id":"F2022-AR-C016","type":"Annual Report","date":"2023-02-27","title":"2022 Annual Report","body":"Strong revenue growth to $42.6 million driven by positive Phase I clinical results and academic collaborations. BASF partnership advances polymer materials science for enhanced drug delivery. European regulatory pathway confirmed through EMA scientific advice."},
  {"doc_id":"F2023-AR-C016","type":"Annual Report","date":"2024-02-29","title":"2023 Annual Report","body":"Revenue reached $58.0 million highlighted by strategic Pfizer partnership worth up to $200 million in milestones. PrecisionDx diagnostic platform launch diversifies revenue streams. J&J collaboration validates technology across multiple therapeutic applications."},
  {"doc_id":"F2024-AR-C016","type":"Annual Report","date":"2025-02-28","title":"2024 Annual Report","body":"Revenue of $79.0 million achieved despite temporary manufacturing challenges. Fast Track designation accelerates development timeline. Asian operations expansion creates regional growth opportunities. GMP facility certification enables commercial production readiness."},
  {"doc_id":"IND-2020-06-C016","type":"Regulatory Filing","date":"2020-06-18","title":"NanoTarget Cancer Therapy IND Application","body":"Investigational New Drug application submitted to FDA for NanoTarget nanotherapy platform targeting solid tumors. Application includes comprehensive preclinical safety and efficacy data, manufacturing information, and clinical trial protocol for Phase I dose-escalation study."},
  {"doc_id":"PHASE1-2021-11-C016","type":"Clinical Trial","date":"2021-11-25","title":"Phase I Clinical Trial Initiation","body":"First-in-human Phase I clinical trial initiated for NanoTarget cancer therapy evaluating safety, tolerability, and preliminary efficacy in patients with advanced solid tumors. Trial design includes dose-escalation and expansion cohorts across multiple cancer types."},
  {"doc_id":"RESULTS-2022-12-C016","type":"Clinical Results","date":"2022-12-08","title":"Phase I Safety and Efficacy Results","body":"Positive Phase I clinical trial results demonstrate favorable safety profile with manageable side effects and encouraging preliminary efficacy signals. Objective response rate of 35% in evaluable patients exceeds historical benchmarks for advanced cancer therapies."},
  {"doc_id":"PFIZER-2023-09-C016","type":"Partnership Agreement","date":"2023-09-14","title":"Strategic Pfizer Oncology Collaboration","body":"Multi-year strategic partnership with Pfizer for nanomedicine development and commercialization including up to $200 million in milestone payments plus tiered royalties. Collaboration covers multiple oncology indications and combination therapy approaches."},
  {"doc_id":"MANUF-2024-03-C016","type":"Manufacturing Issue","date":"2024-03-22","title":"Production Scale-up Challenges","body":"Encountered technical difficulties in scaling nanoparticle manufacturing processes resulting in Phase II trial timeline delay. Issues include batch-to-batch variability and yield optimization challenges in larger production volumes."},
  {"doc_id":"RESOLVE-2024-10-C016","type":"Resolution Document","date":"2024-10-15","title":"Manufacturing Enhancement Implementation","body":"Successfully implemented advanced production protocols and quality systems addressing scale-up challenges. New processes achieve consistent batch quality and improved yields enabling resumed clinical development timeline."},
  {"doc_id":"JV-2025-02-C016","type":"Joint Venture Agreement","date":"2025-02-10","title":"BioTech Alliance Formation","body":"Joint venture with Medisafe Health and NeuraGen AI creating integrated precision medicine platform combining nanotherapy delivery with healthcare services and AI analytics. Alliance targets personalized cancer treatment and diagnostic applications."},
  {"doc_id":"ER-2025-08-C016","type":"Earnings Release","date":"2025-08-19","title":"Q2 2025 Strong Financial Performance","body":"Record Q2 2025 revenue of $24.8 million driven by partnership milestone achievements and technology licensing agreements. Full-year guidance raised based on strong partnership momentum and clinical development progress."},
  {"doc_id":"PAT-2020-11-C016","type":"Patent Grant","date":"2020-11-30","title":"Nanoparticle Tumor Targeting Patent","body":"Patent US10,987,654 granted for tumor-targeting nanoparticle technology including ligand conjugation methods and targeted drug delivery mechanisms. Patent provides competitive protection for core nanotherapy platform technology."},
  {"doc_id":"FUND-2021-09-C016","type":"Funding Document","date":"2021-09-15","title":"Series A Funding Round $40 Million","body":"Series A funding completed raising $40 million from specialized biotechnology and nanomedicine investors. Funding supports clinical development acceleration, manufacturing scaling, and technology platform expansion."},
  {"doc_id":"BASF-2022-04-C016","type":"Partnership Agreement","date":"2022-04-18","title":"BASF Materials Science Collaboration","body":"Strategic partnership with BASF for advanced polymer materials development enhancing nanoparticle formulation capabilities. Collaboration includes joint research projects and exclusive access to specialized materials for nanomedicine applications."},
  {"doc_id":"EMA-2023-02-C016","type":"Regulatory Guidance","date":"2023-02-14","title":"European Medicines Agency Scientific Advice","body":"Received positive scientific advice from EMA confirming European clinical development pathway and regulatory strategy. Guidance covers clinical trial design, endpoints, and regulatory submission requirements for European approval."},
  {"doc_id":"PRECISION-2023-06-C016","type":"Product Launch","date":"2023-06-12","title":"PrecisionDx Diagnostic Nanoparticles","body":"Commercial launch of PrecisionDx diagnostic nanoparticle platform enabling precision medicine applications including biomarker detection and treatment response monitoring. Platform provides complementary revenue stream to therapeutic programs."},
  {"doc_id":"FASTTRACK-2024-08-C016","type":"FDA Designation","date":"2024-08-20","title":"FDA Fast Track Designation","body":"FDA granted Fast Track designation for lead oncology nanotherapy program based on significant unmet medical need and preliminary clinical efficacy. Designation enables accelerated development timeline and enhanced FDA interaction."},
  {"doc_id":"GMP-2025-01-C016","type":"Manufacturing Certification","date":"2025-01-22","title":"GMP Facility Certification Achievement","body":"Achieved Good Manufacturing Practice certification for nanomedicine production facility enabling commercial-scale manufacturing capability. Certification covers all aspects of nanoparticle production, quality control, and regulatory compliance."}
]
