[
  {"doc_id":"F2020-AR-C015","type":"Annual Report","date":"2021-03-01","title":"2020 Annual Report","body":"StratoSky Aerospace achieved key milestones with reusable launcher test flights and early satellite bus development, positioning for expanded market engagement and technology leadership. Revenue reached $85.7 million with successful prototype demonstrations. Key risks include launch failure liability and supply chain dependencies. ESG initiatives focus on sustainable aerospace manufacturing and carbon footprint reduction."},
  {"doc_id":"F2021-AR-C015","type":"Annual Report","date":"2022-02-28","title":"2021 Annual Report","body":"Commercial launch of satellite bus expanded offerings; partnerships with key space agencies increased revenue visibility and pipeline strength. Revenue grew to $124.9 million with Series B funding enabling development acceleration. International expansion commenced with European operations."},
  {"doc_id":"F2022-AR-C015","type":"Annual Report","date":"2023-02-27","title":"2022 Annual Report","body":"Secured NASA and ESA contracts expanded revenue streams; R&D investments in ground systems and launch automation increased competitive advantages. Revenue reached $150.3 million with successful satellite deployments demonstrating operational capabilities."},
  {"doc_id":"F2023-AR-C015","type":"Annual Report","date":"2024-02-29","title":"2023 Annual Report","body":"Multi-launch government contracts boosted booking growth despite sector challenges; new modular platform releases enhanced customer integration capabilities. Revenue of $183.4 million reflects strong market position and technology validation."},
  {"doc_id":"F2024-AR-C015","type":"Annual Report","date":"2025-02-28","title":"2024 Annual Report","body":"Joint ventures and strategic partnerships launched to expand cloud-integrated aerospace offerings; strong financial results demonstrate growth momentum. Revenue reached $221.5 million with APAC expansion creating regional opportunities."},
  {"doc_id":"ER-2025-08-C015","type":"Earnings Release","date":"2025-08-19","title":"Q2 2025 Earnings Release","body":"Reported strong Q2 results with revenue of $63.5 million and EPS growth of 21% year-over-year, supported by multi-sector industry collaborations and innovative product launches. Full-year guidance raised based on robust pipeline and partnership momentum."},
  {"doc_id":"IP2021-12-C015","type":"Product Launch","date":"2021-12-12","title":"SkyLink Satellite Bus Commercial Launch","body":"Commercial launch of SkyLink modular satellite platform targeting small and medium payload markets. Platform features standardized interfaces, flexible configuration options, and cost-effective integration services for commercial and government customers."},
  {"doc_id":"CNT-2022-10-C015","type":"Government Contract","date":"2022-10-25","title":"NASA and ESA Ground Systems Contract","body":"Multi-year contract to provide OrbitalOps ground systems and launch support services for NASA and ESA missions. Contract includes mission planning, launch operations, and ongoing technical support with total value exceeding $45 million over five years."},
  {"doc_id":"JV-2025-02-C015","type":"Joint Venture Agreement","date":"2025-02-10","title":"Tri-Forge Joint Venture Formation","body":"Strategic joint venture with Borealis CloudWorks and Cobalt CyberGuard creating integrated aerospace solutions combining launch services, cloud computing, and cybersecurity. Initiative targets government and commercial customers requiring comprehensive space technology solutions."},
  {"doc_id":"FAA-2020-09-C015","type":"Regulatory Approval","date":"2020-09-22","title":"FAA Commercial Space Transportation License","body":"Federal Aviation Administration granted commercial space transportation license enabling StratoSky to conduct commercial satellite launch operations. License covers reusable launch vehicle operations and commercial payload deployment services."},
  {"doc_id":"FUND-2021-08-C015","type":"Funding Document","date":"2021-08-30","title":"Series B Funding Round $50 Million","body":"Series B funding completed raising $50 million from aerospace and defense focused venture capital firms. Funding supports manufacturing scaling, technology development, and international market expansion. Lead investors include established aerospace industry specialists."},
  {"doc_id":"SPACEX-2021-04-C015","type":"Partnership Agreement","date":"2021-04-08","title":"SpaceX Engine Supply Partnership","body":"Strategic partnership with SpaceX for rocket engine technology and supply arrangements. Partnership includes engine procurement, technical collaboration, and joint development initiatives for next-generation launch vehicle systems."},
  {"doc_id":"SUCCESS-2022-07-C015","type":"Mission Success Report","date":"2022-07-19","title":"Commercial Satellite Deployment Success","body":"Successful deployment of commercial communication satellites demonstrating operational capability and reliability. Mission achieved all primary objectives with satellites operating normally in target orbits. Customer satisfaction scores exceeded expectations."},
  {"doc_id":"TECH-2023-01-C015","type":"Technology Breakthrough","date":"2023-01-25","title":"Reusable Engine Technology Advancement","body":"Breakthrough development in reusable rocket engine technology achieving 40% improvement in efficiency and 60% reduction in refurbishment time. Technology enables significant cost reduction for multiple-use launch operations."},
  {"doc_id":"AWARD-2023-09-C015","type":"Industry Recognition","date":"2023-09-12","title":"Aerospace Innovation Award Recognition","body":"Recognition from Aerospace Industries Association for breakthrough reusable launch technology innovation. Award highlights StratoSky's contribution to advancing sustainable and cost-effective space access solutions."},
  {"doc_id":"SAFETY-2024-04-C015","type":"Safety Certification","date":"2024-04-22","title":"Comprehensive Launch Safety Certification","body":"Achieved launch safety certification from multiple commercial launch ranges enabling expanded operational flexibility. Certification covers safety procedures, risk assessment protocols, and emergency response capabilities."},
  {"doc_id":"APAC-2024-07-C015","type":"International Expansion","date":"2024-07-30","title":"Asia-Pacific Operations Launch","body":"Established Singapore subsidiary targeting Asian space market opportunities. Operations include regional sales, customer support, and partnership development with Asian satellite operators and government agencies."},
  {"doc_id":"STRATO-2024-11-C015","type":"Product Development","date":"2024-11-14","title":"StratoLift 2.0 Development Program","body":"Next-generation StratoLift 2.0 reusable launcher development program featuring enhanced payload capacity, improved reusability, and advanced avionics systems. Program targets commercial and government market requirements."},
  {"doc_id":"USSF-2025-04-C015","type":"Government Contract","date":"2025-04-16","title":"US Space Force National Security Launch","body":"Contract with US Space Force for national security satellite launch services. Multi-mission contract provides launch services for classified and unclassified government payloads with stringent security and reliability requirements."},
  {"doc_id":"CONSTELLATION-2025-08-C015","type":"Commercial Contract","date":"2025-08-05","title":"Mega-Constellation Deployment Contract","body":"Multi-year contract for large satellite constellation deployment services including launch operations, mission planning, and ongoing support. Contract represents significant long-term revenue commitment from commercial satellite operator."}
]
