[{"doc_id":"F2020-10K-C005","type":"10-K Filing","date":"2021-03-01","title":"Annual Report 2020","body":"QuantumQuill Software Inc. reports revenue of $43.3 million for FY2020, a 28% YoY increase driven by the sudden digitization of enterprise documentation needs. Gross margin of 72.6% reflects a software-first model with modest hosting costs and a growing enterprise base. Key highlights include the expansion of QuillFlow for policy-to-document automation and foundational investments into QuillOps, a knowledge graph and retrieval orchestration layer aimed at regulated outputs. Risk factors emphasize model error in regulated content, third-party dependency on hyperscale providers, and pricing pressure from generalist tools. The company continued to invest in security and privacy controls (SOC 2 Type II, HIPAA BAA readiness), implemented a renewable-aware deployment strategy via partners, and initiated a patent program around provenance and lineage tracking for generated content. Liquidity remains adequate with $5.2 million cash and access to a working capital facility. Management confirms effective internal controls over financial reporting. Signed by CEO Zara Montes; CFO Leon Wu; auditors Keene & Walsh LLP."},
{"doc_id":"F2021-10K-C005","type":"10-K Filing","date":"2022-02-28","title":"Annual Report 2021","body":"FY2021 revenue reached $60.7 million (+40%), with gross margin at 73.0% and operating income improving on scale. The company launched QuillOps v2 (knowledge graph + RAG orchestration) and enhanced compliance offerings, achieving HIPAA BAA readiness for healthcare opportunities. OEM distribution agreements added an industrial channel. The IP portfolio expanded with filings focused on lineage, provenance, and governed prompting. The report details revenue recognition under ASC 606, stock-based compensation, leases, and expansion plans in Europe and APAC. The board strengthened oversight for model governance and established AI policy review cadences."},
{"doc_id":"F2022-10K-C005","type":"10-K Filing","date":"2023-02-27","title":"Annual Report 2022","body":"FY2022 revenue rose to $87.6 million (+44%), as GDPR-ready policy layers and EU data residency partnerships improved win rates. Notable wins included public sector agencies and healthcare networks deploying guardrails for regulated documents. R&D targeted evaluation harnesses, automated redaction, and purpose limitation controls. Management reiterates risk from potential ‘AI safety’ narratives in the market and outlines mitigation via third-party evaluations and transparent governance. The company maintained strong cash conversion and stable churn metrics."},
{"doc_id":"F2023-10K-C005","type":"10-K Filing","date":"2024-02-29","title":"Annual Report 2023","body":"FY2023 revenue was $107.0 million (+22%), reflecting resilience despite a competitor-led FUD campaign that temporarily impacted SMB segments in Q2–Q3. Countermeasures included public evaluation harnesses and external audits, contributing to a recovery in sentiment and continued enterprise adoption. Integrations with security (C004) and green-cloud residency (C003) strengthened standing in regulated and EU markets. The report includes updated model risk management disclosures and a commitment to quarterly lineage KPI reporting."},
{"doc_id":"F2024-10K-C005","type":"10-K Filing","date":"2025-02-28","title":"Annual Report 2024","body":"FY2024 revenue reached $125.9 million (+17.7%), gross margin 73.1%, with QuillSign launching in Q4 to expand ARPU. The firm published a public AI use-policy and lineage KPIs each quarter, improving buyer confidence post rumor scare in Q1. Big4 consultancy partnerships accelerated BFSI templates and deals. Management highlights ongoing risks of price pressure at the SMB tier while reaffirming enterprise focus and value bundling. Cash at year end was $12.2 million with a 9-month liquidity target."},
{"doc_id":"IP2020-08-C005","type":"Investor Presentation","date":"2020-08-25","title":"Security-Backed Renders","body":"Slides cover HSM integration objectives, tamper-evident document pipelines, and compliance mappings for regulated sectors. Early pilot feedback emphasizes auditor satisfaction and reduced exception rates. Financial outlook anticipates conversion rate gains in healthcare and insurance verticals."},
{"doc_id":"IP2021-06-C005","type":"Investor Presentation","date":"2021-06-10","title":"QuillOps v2 – KnowledgeOps for Enterprises","body":"A 10-slide deck explains entity graphing, RAG orchestration, governed prompts, and audit logs. Case studies show contract cycle time reductions and lower error rates in policy documents. Forecasts include improved win rate by 5–8 points and international expansion via localization packs."},
{"doc_id":"IP2022-03-C005","type":"Investor Presentation","date":"2022-03-08","title":"GDPR Policy Layer & EU Wins","body":"Detail of automated redaction, purpose binding, and consent-aware outputs. Includes comparative analysis of DPA requirements and a roadmap for additional EU-localized features. Early adopters report reduced privacy review cycles by 30%."},
{"doc_id":"IP2023-05-C005","type":"Investor Presentation","date":"2023-05-25","title":"Transparency & Evaluation Harness","body":"The deck discloses benchmark suites, adversarial prompts, and scoring methods shared publicly to enable apples-to-apples assessments. Charts show QQSL’s improvements over the prior quarter in critical categories like factuality, sensitive data leakage, and policy adherence."},
{"doc_id":"IP2024-03-C005","type":"Investor Presentation","date":"2024-03-04","title":"Public AI Use-Policy & Lineage Reporting","body":"Defines policy architecture, change management, and quarterly KPI reporting. Highlights downstream customer benefits in procurement and due diligence. Includes governance lifecycle and incident disclosure processes."},
{"doc_id":"IP2024-11-C005","type":"Investor Presentation","date":"2024-11-19","title":"QuillSign Launch","body":"Shows the integration of e-sign with policy guards, PKI, and tamper-evident logs. Pricing tiers designed to drive ARPU and attach rate with QuillOps. Customer narratives from insurance and BFSI preview expanded use-cases."},
{"doc_id":"JV-2025-02-C005","type":"Investor Presentation","date":"2025-02-10","title":"Tri-Forge JV Overview (C002+C003+C004)","body":"Explains the regulated RAG stack composed of quantum-quill lineage governance, Borealis green/hybrid nodes, and Cobalt zero-trust attestations. Articulates TAM displacement vs hyperscalers’ native offerings and a phased market-entry plan starting with BFSI."},
{"doc_id":"Case-2020-05-C005","type":"Case Study","date":"2020-05-12","title":"Fintech Onboarding Time -60%","body":"Describes the before/after workflow, validation steps, and controls implemented. Reports dramatic reductions in manual review and improved customer satisfaction metrics."},
{"doc_id":"Case-2021-11-C005","type":"Case Study","date":"2021-11-29","title":"Retail SOPs Across 1,200 Stores","body":"Walks through deployment, content governance, and training materials. Measures include shrinkage documentation compliance and audit readiness."},
{"doc_id":"Case-2022-10-C005","type":"Case Study","date":"2022-10-11","title":"Clinical Guardrails Reduce Exceptions 55%","body":"Explains regulatory mappings, WHO ICD references, and hospital approval workflows. Quantifies reductions in compliance exceptions and reviewer burden."},
{"doc_id":"Case-2023-11-C005","type":"Case Study","date":"2023-11-20","title":"QuillSign Upsell in Insurance","body":"Outlines the value of policy-guarded signatures in claims and underwriting. Shows ARPU uplift and reduced back-and-forth."},
{"doc_id":"Case-2025-06-C005","type":"Case Study","date":"2025-06-03","title":"BFSI Multi-country Rollout","body":"Covers GDPR + SOX mapping, controls testing, and audit success in 8 weeks. Includes org change plan and measured productivity gains."},
{"doc_id":"Policy-2024-03-C005","type":"Policy","date":"2024-03-04","title":"Public AI Use-Policy (Customer-Facing)","body":"Full policy text covering acceptable use, model governance, lineage, redaction, consent handling, incident management, and customer responsibilities, with plain-language and legal sections."},
{"doc_id":"ER-2025-08-C005","type":"Earnings Release","date":"2025-08-19","title":"Q2 2025 Beat & Raise","body":"Announces ARR $210M, EPS +16% YoY, healthy net retention, and raised FY guidance. Cites JV momentum, BFSI wins, and continued trust via lineage KPIs and governance cadence."}
]